aaron-bond.better-comments
almenon.arepl
blackboxapp.blackbox
charliermarsh.ruff
christian-kohler.path-intellisense
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
ecmel.vscode-html-css
formulahendry.code-runner
github.github-vscode-theme
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
janisdd.vscode-edit-csv
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-account
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
ms-vscode.vs-keybindings
ninoseki.vscode-pylens
njpwerner.autodocstring
oderwat.indent-rainbow
paiqo.databricks-vscode
randomfractalsinc.vscode-data-table
redhat.vscode-yaml
ritwickdey.liveserver
shardulm94.trailing-spaces
sourcery.sourcery
streetsidesoftware.code-spell-checker
stuart.unique-window-colors
usernamehw.errorlens
vscode-icons-team.vscode-icons
wmaurer.change-case
